In [1]:
#with column

In [2]:
import os
import sys
from pyspark.sql import SparkSession
os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable
import pyspark
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('withcolumn').getOrCreate()

In [3]:
data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]

columns = ["firstname","middlename","lastname","dob","gender","salary"]
df = spark.createDataFrame(data=data, schema = columns)

In [4]:
df.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [5]:
df.show()

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [47]:
from pyspark.sql.functions import *
dfchange = df.withColumn("salary",col("salary").cast("int"))
dfchange.show()

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [48]:
dfchange.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)

In [20]:
df.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [30]:
df1 = df.withColumn("Country", lit("USA"))

In [31]:
df1.show()

+---------+----------+--------+----------+------+------+-------+
|firstname|middlename|lastname|       dob|gender|salary|Country|
+---------+----------+--------+----------+------+------+-------+
|    James|          |   Smith|1991-04-01|     M|  3000|    USA|
|  Michael|      Rose|        |2000-05-19|     M|  4000|    USA|
|   Robert|          |Williams|1978-09-05|     M|  4000|    USA|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|    USA|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|    USA|
+---------+----------+--------+----------+------+------+-------+

In [32]:
df2 = df1.withColumn("test1",lit("NA")).withColumn("test2",lit("NAN"))

In [33]:
df2.show()

+---------+----------+--------+----------+------+------+-------+-----+-----+
|firstname|middlename|lastname|       dob|gender|salary|Country|test1|test2|
+---------+----------+--------+----------+------+------+-------+-----+-----+
|    James|          |   Smith|1991-04-01|     M|  3000|    USA|   NA|  NAN|
|  Michael|      Rose|        |2000-05-19|     M|  4000|    USA|   NA|  NAN|
|   Robert|          |Williams|1978-09-05|     M|  4000|    USA|   NA|  NAN|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|    USA|   NA|  NAN|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|    USA|   NA|  NAN|
+---------+----------+--------+----------+------+------+-------+-----+-----+

In [36]:
#Renaming existing column
df3 = df2.withColumnRenamed("test1","dummy1")
df3.show()

+---------+----------+--------+----------+------+------+-------+------+-----+
|firstname|middlename|lastname|       dob|gender|salary|Country|dummy1|test2|
+---------+----------+--------+----------+------+------+-------+------+-----+
|    James|          |   Smith|1991-04-01|     M|  3000|    USA|    NA|  NAN|
|  Michael|      Rose|        |2000-05-19|     M|  4000|    USA|    NA|  NAN|
|   Robert|          |Williams|1978-09-05|     M|  4000|    USA|    NA|  NAN|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|    USA|    NA|  NAN|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|    USA|    NA|  NAN|
+---------+----------+--------+----------+------+------+-------+------+-----+

In [37]:
#dropping column from table
df4 = df3.drop("test2")
df4.show()

+---------+----------+--------+----------+------+------+-------+------+
|firstname|middlename|lastname|       dob|gender|salary|Country|dummy1|
+---------+----------+--------+----------+------+------+-------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|    USA|    NA|
|  Michael|      Rose|        |2000-05-19|     M|  4000|    USA|    NA|
|   Robert|          |Williams|1978-09-05|     M|  4000|    USA|    NA|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|    USA|    NA|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|    USA|    NA|
+---------+----------+--------+----------+------+------+-------+------+

In [42]:
df5 = df4.withColumn("salary",col("salary")*2)

In [43]:
df5.show()

+---------+----------+--------+----------+------+------+-------+------+
|firstname|middlename|lastname|       dob|gender|salary|Country|dummy1|
+---------+----------+--------+----------+------+------+-------+------+
|    James|          |   Smith|1991-04-01|     M|  6000|    USA|    NA|
|  Michael|      Rose|        |2000-05-19|     M|  8000|    USA|    NA|
|   Robert|          |Williams|1978-09-05|     M|  8000|    USA|    NA|
|    Maria|      Anne|   Jones|1967-12-01|     F|  8000|    USA|    NA|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -2|    USA|    NA|
+---------+----------+--------+----------+------+------+-------+------+

In [46]:
df4.withColumn("salary",col("salary")+1).show()

+---------+----------+--------+----------+------+------+-------+------+
|firstname|middlename|lastname|       dob|gender|salary|Country|dummy1|
+---------+----------+--------+----------+------+------+-------+------+
|    James|          |   Smith|1991-04-01|     M|  3001|    USA|    NA|
|  Michael|      Rose|        |2000-05-19|     M|  4001|    USA|    NA|
|   Robert|          |Williams|1978-09-05|     M|  4001|    USA|    NA|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4001|    USA|    NA|
|      Jen|      Mary|   Brown|1980-02-17|     F|     0|    USA|    NA|
+---------+----------+--------+----------+------+------+-------+------+